/**********************************************************************************
********************* (C) COPYRIGHT 2012 蓝宙电子科技有限公司 *********************
***********************************************************************************
 * 描述         ：线性CCD测试程序
 *
 * 实验平台     ：蓝宙电子XS128系统板 + TSL1401线性CCD传感器
 *
 * 作者         ：蓝宙电子科技有限公司
 * 淘宝店       ：http://landzo.taobao.com
 * 网站         ：http://www.landzo.cn
**********************************************************************************/
/*
*********************************************************************************************************
*
*                                      MCU: MC9S12XS128MAL - 112Pin
*                                      OSC: 16.000MHz
*                                      BUS: 40.0MHz
*
* File : PIT.c
* By   : Ke Chao
*********************************************************************************************************
*/

#include "includes.h"


/*
*********************************************************************************************************
* Description: PIT_Init
* Note: Fbus = 40M
*********************************************************************************************************
*/
void PIT_Init(void) {
    PITCE_PCE0 = 1;             //Enable Timer Channel0
    PITMUX_PMUX0 = 0;           //16-bit timer counts with micro time base 0
//time-out period = (PITMTLD + 1) * (PITLD + 1) / fBUS
//1ms
    PITMTLD0 = 199;             //PIT Micro Timer Load Register
    PITLD0 = 199;               //PIT Load Register
    PITINTE_PINTE0 = 1;         //Enable Timer Channel0 Interrupt
    PITCFLMT_PITE = 1;          //Enable Timer
}